String major_category_json = '''
    [
    {
        "id": 1,
        "name": "정보대학",
        "categories": [
            {
                "id": 9,
                "name": "진로정보 - 공모전"
            },
            {
                "id": 8,
                "name": "진로정보 - 인턴"
            },
            {
                "id": 7,
                "name": "진로정보 - 교육"
            },
            {
                "id": 6,
                "name": "대학원 장학공지"
            },
            {
                "id": 5,
                "name": "학부 장학공지"
            },
            {
                "id": 4,
                "name": "대학원 공지사항"
            },
            {
                "id": 3,
                "name": "진로정보 - 채용"
            },
            {
                "id": 2,
                "name": "행사 및 소식"
            },
            {
                "id": 1,
                "name": "학부 공지사항"
            }
        ]
    },
    {
        "id": 2,
        "name": "디자인조형학부",
        "categories": [
            {
                "id": 14,
                "name": "새소식 - 취업"
            },
            {
                "id": 12,
                "name": "대학원 공지사항"
            },
            {
                "id": 11,
                "name": "학사자료실(학부)"
            },
            {
                "id": 13,
                "name": "학사자료실(대학원)"
            },
            {
                "id": 15,
                "name": "새소식 - 공모전, 행사"
            },
            {
                "id": 16,
                "name": "새소식 - 자유게시판"
            },
            {
                "id": 10,
                "name": "학부 공지사항"
            }
        ]
    },
    {
        "id": 3,
        "name": "미디어학부",
        "categories": [
            {
                "id": 19,
                "name": "채용정보"
            },
            {
                "id": 18,
                "name": "학부 공지사항"
            },
            {
                "id": 20,
                "name": "공모전, 행사"
            }
        ]
    },
    {
        "id": 4,
        "name": "자유전공학부",
        "categories": [
            {
                "id": 21,
                "name": "공지사항"
            }
        ]
    },
    {
        "id": 5,
        "name": "정경대학",
        "categories": [
            {
                "id": 22,
                "name": "일반공지사항"
            }
        ]
    },
    {
        "id": 6,
        "name": "KUPID",
        "categories": [
            {
                "id": 25,
                "name": "학사일정"
            },
            {
                "id": 24,
                "name": "장학금공지"
            },
            {
                "id": 23,
                "name": "일반공지"
            }
        ]
    }
]
    ''';
